InformationRegisters/СоответствиеНастроекИнтеграцииИнтернетЭквайринг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеНастроекИнтеграцииИнтернетЭквайринг</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиПодключенияКИнтернетЭквайрингу</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОплатОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СоответствиеНастроекИнтеграцииИнтернетЭквайринг/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция НастройкаИнтеграции(Организация, ВидОплаты = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоответствиеНастроекИнтеграции.НастройкаПодключения КАК НастройкиИнтеграции
	|ИЗ
	|	РегистрСведений.СоответствиеНастроекИнтеграцииИнтернетЭквайринг КАК СоответствиеНастроекИнтеграции
	|ГДЕ
	|	СоответствиеНастроекИнтеграции.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Если ВидОплаты <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + " И СоответствиеНастроекИнтеграции.ВидОплаты = &ВидОплаты";
		Запрос.УстановитьПараметр("ВидОплаты", ВидОплаты);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НастройкиИнтеграции;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции


// Определяет настройки торговой точки платежной системы.
//
// Параметры:
//  СправочникСсылка.СоответствиеНастроекИнтеграцииИнтернетЭквайринг - настройка подключения к интернет эквайрингу
//
// Возвращаемое значение:
//  Структура - настройки торговой точки:
//    *Организация - СправочникСсылка.Организации - организация из документа продажи;
//    *ВидОплаты - СправочникСсылка.ВидОплаты - вид оплаты для документа отражения оплаты.
//
Функция НастройкиТорговойТочки(НастройкиИнтеграции) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоответствиеНастроекИнтеграции.Организация КАК Организация,
	|	СоответствиеНастроекИнтеграции.ВидОплаты КАК ВидОплаты
	|ИЗ
	|	РегистрСведений.СоответствиеНастроекИнтеграцииИнтернетЭквайринг КАК СоответствиеНастроекИнтеграции
	|ГДЕ
	|	СоответствиеНастроекИнтеграции.НастройкаПодключения = &НастройкиИнтеграции";
	
	Запрос.УстановитьПараметр("НастройкиИнтеграции", НастройкиИнтеграции);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Результат = Новый Структура;
		Результат.Вставить("Организация", ВыборкаДетальныеЗаписи.Организация);
		Результат.Вставить("ВидОплаты",   ВыборкаДетальныеЗаписи.ВидОплаты);
		
		Возврат Результат;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ВсеНастройкиИнтеграции() Экспорт
	
	Организации = ОбщегоНазначенияБПВызовСервераПовтИсп.ВсеОрганизацииДанныеКоторыхДоступныПоRLS(Ложь);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организации", Организации);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоответствиеНастроекИнтеграцииИнтернетЭквайринг.НастройкаПодключения КАК НастройкаПодключения
	|ИЗ
	|	РегистрСведений.СоответствиеНастроекИнтеграцииИнтернетЭквайринг КАК СоответствиеНастроекИнтеграцииИнтернетЭквайринг
	|ГДЕ
	|	СоответствиеНастроекИнтеграцииИнтернетЭквайринг.Организация В(&Организации)";
	
	Настройки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ТорговаяТочка");
	Возврат Настройки;
КонецФункции


#КонецОбласти

#КонецЕсли
